driver-tests/bpelse/dynamicpartnerlink/correlation/correlationJbi/test/CorrInvFlowW1G6_Correlation/Input1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="InvFlowparent">
  <soapenv:Body>
    <inv:InvFlowparentElement>
      <inv:string>input</inv:string>
    </inv:InvFlowparentElement>
  </soapenv:Body>
</soapenv:Envelope>